<?php include("../modules/header.php") ?>

    <div  class="container bg-light rounded shadow px-5 py-3" id="main">
        <!--<h2>Кафедра програмного забезпечення систем</h2>-->
        <!--Напрям підготовки   		<b>050103 Програмна інженерія</b><br>-->
        <!--Галузь знань   			<b>0501 Інформатика та обчислювальна техніка</b><br>-->
        <!--Освітньо-кваліфікаційний рівень:   <b>бакалавр, спеціаліст, магістр</b><br>-->
        <!--Кваліфікація бакалавра: 		 <b>фахівець з розробки та тестування програмного забезпечення</b><br> -->
        <!--Кваліфікація спеціаліста: 		 <b>аналітик комп‘ютерних систем</b><br> -->
        <!--Кваліфікація магістра: 		 <b>магістр комп‘ютерних наук</b><br>-->
        <!--<br>-->
        <!--Термін навчання за денною формою:<br>-->
        <!--Бакалавр - 3 роки 10 місяців<br>-->
        <!--Спеціаліст, магістр - 1 рік.-->
        <!--<br>-->
        <!--<p>В бакалавраті «Програмна інженерія» готують фахівців з усіх аспектів створення, супроводження і використання будь - якого програмного забезпечення.</p>-->
        <!--<p>Студенти вивчають розробку програм в контексті різних мов програмування, виходячи з інженерних засад, засвоюючи методи та засоби проектування, конструювання і супроводження  програм, без знання яких неможливе грамотне створення програмного забезпечення. Вивчення цих методів ведеться із застосуванням найсучасніших технологій та інструментів.</p>-->
        <!--<p>Мета інженерії програмного забезпечення – проектувати, створювати та супроводжувати велике програмне забезпечення (мільйони програмних команд) у заданий термін, не витративши зайвих грошей, досягаючи потрібної якості. Для цього студенти навчаються структурному і об’єктно-орієнтованому аналізу та проектуванню, тестуванню, верифікації, супроводженню, оцінці вартості програмного забезпечення і його адмініструванню. Інженерія програмного забезпечення – це багатомільярдна, з точку зору інвестицій, галузь економіки будь – якої розвиненої держави. В галузі реалізуються великі та малі проекти, що потребують кваліфікованого менеджменту. Тому, студенти навчаються вирішувати у колективі завдання обґрунтування, планування, забезпечення економічної ефективності, якісної та своєчасної реалізації проектів. В ієрархії посад комп’ютерної індустрії менеджер проектів – найбільш відповідальна та високооплачувана робота.</p>-->
        <!--<p><b>Напрям "Програмна інженерія" (Програмне забезпечення автоматизованих систем)</b> орієнтована на підготовку фахівців для розробки ЕRP-, MES-, SCADA-систем та web-додатків.</p>-->
        <!--<p><b>ЕRP-системи</b> (Enterprise Resource Planning) - планування ресурсів підприємства. Дана абревіатура використається для позначення програмних систем, які використовують для керування ресурсами підприємства. Спектр завдань, розв'язуваних за допомогою таких систем:</p>-->
        <!--<ul>-->
        <!--	<li>керування фінансами;-->
        <!--	</li><li>керування закупівлями;-->
        <!--	</li><li>керування продажами;-->
        <!--	</li><li>керування персоналом;-->
        <!--	</li><li>внутрішній облік.-->
        <!--<p><b><i>Засоби програмування</i></b> - Visual Studio.NET та MSSQL.</p>-->
        <!--</li></ul>-->
        <!---->
        <!--<p><b>MES-системи</b> (Manufacturing Execution System) - автоматизована система керування виробничими процесами. Системи даного класу - сполучна ланка між ERP-системами й безпосередньо виробництвом.<br>-->
        <!--Завдання, які вирішуються за допомогою MES-систем:</p>-->
        <!--<ul>-->
        <!--	<li>планування й контроль завантаження виробничого встаткування;-->
        <!--	</li><li>резервування сировини й деталей, використовуваних у виробництві;-->
        <!--	</li><li>планування й контроль людських ресурсів, задіяних у виробничому процесі;-->
        <!--	</li><li>контроль спрацювання устаткування;-->
        <!--	</li><li>облік витрат енергії;-->
        <!--	</li><li>контроль якості готової продукції, аналіз факторів, що впливають на якість;-->
        <!--	</li><li>розрахунок собівартості виробів.-->
        <!--<p><b><i>Засоби програмування</i></b> - Visual Studio.NET та MSSQL, Delphi та Interbase.</p>-->
        <!--</li></ul>-->
        <!---->
        <!--<p><b>Web-програмування.</b><br>-->
        <!--Структура і принципи Web. Створення Web-додатків. Клієнтські і серверні сценарії. Розробка Web-застосувань на платформі .Net. Стандартна мова розмітки Web-сторінок HTML. Каскадні таблиці стилів CSS - технології описання зовнішнього вигляду документів формату HTML. Скриптова мова програмування PHP, що використовується для створення динамічних Web-сайтів та спрощує задачу обробки форм, поступивши з браузера.</p> -->
        <!--<p>Випускники з цієї спеціальності – це спеціалісти у сферах: розробки, впровадження та супроводження інформаційного, функціонального та програмного забезпечення автоматизованих систем.</p>-->
        <!--<p>Випускники кафедри мають високу конкурентоздатність на ринку праці. Вони працюють у всіх сферах, де використовується обчислювальна техніка: банках, податкових службах, страхових, консалтингових і фінансових установах, промислових підприємствах, як в Україні, так і за кордоном.</p>-->
        <!--<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<b><i>Засоби програмування</i></b> - ASP.NET та MSSQL, PHP та mySQL, JavaScript  та MongoDB.</p>-->
        <!---->
        <!--<div align="center"><p><b><i>3а результатами досліджень, проведених Національною Академією Наук наша спеціальність є найбільш затребуваною на наступні 20 років.</i></b></p></div>-->
        <!---->
        <!--<b>Дисципліни, що викладаються в рамках спеціальності:</b>-->
        <!--<ol>-->
        <!--<li>Алгоритми та структури даних-->
        <!--</li><li>Аналіз вимог до програмного забезпечення-->
        <!--</li><li>Архітектура комп'ютера-->
        <!--</li><li>Архітектура та проектування програмного забезпечення-->
        <!--</li><li>Бази даних -->
        <!--</li><li>Безпека програм та даних-->
        <!--</li><li>Групова динаміка і комунікації-->
        <!--</li><li>Дискретні структури-->
        <!--</li><li>Економіка програмного забезпечення-->
        <!--</li><li>Емпіричні методи програмної інженерії-->
        <!--</li><li>Комп'ютерна дискретна математика-->
        <!--</li><li>Конструювання програмного забезпечення-->
        <!--</li><li>Людино-машинна взаємодія-->
        <!--</li><li>Математичний інструментарій логістики-->
        <!--</li><li>Математичне моделювання складних об'єктів і систем-->
        <!--</li><li>Менеджмент проектів програмного забезпечення-->
        <!--</li><li>Моделювання та аналіз програмного забезпечення-->
        <!--</li><li>Об'єктно-орієнтоване програмування-->
        <!--</li><li>Операційні системи-->
        <!--</li><li>Організація комп'ютерних мереж-->
        <!--</li><li>Основи програмної інженерії-->
        <!--</li><li>Основи програмування-->
        <!--</li><li>Основи комп'ютерної графіки-->
        <!--</li><li>Проектний практикум-->
        <!--</li><li>Професійна практика програмної інженерії-->
        <!--</li><li>Програмування Інтернет-->
        <!--</li><li>Проектування імітаційних моделей та систем-->
        <!--</li><li>Проектування автоматизованих інформаційних систем-->
        <!--</li><li>Технології та засоби створення програмного забезпечення АСУ-->
        <!--</li><li>Технології створення WEB-застосувань -->
        <!--</li><li>Якість програмного забезпечення та тестування-->
        <!--</li></ol>-->
        <!--<p><b>Наша адреса:</b><br>-->
        <!--51918, м. Дніпродзержинськ, вул. Дніпробудівська, 2, корпус № 5<br>-->
        <!--</p>-->
    </div>
<!--    <script src="../js/js-bbcode-parser/xbbcode.js"></script>-->
    <script>
        async function fillPage() {
            const url = "../database/select.php"
            getData({"table": "About"}, url).then(res=>{
                $('#main').html(res[0]['content'])
            })
        }

        $(document).ready(function () {
            fillPage()
        });
    </script>
<?php include("../modules/footer.php") ?>